astrobin_apps_payments/tests/data/ultimate_once_renewal/checkout.session.completed.json

{
  "id": "evt_1NBz48C0tT6bv7HdZUdOK4GL",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1685101456,
  "data": {
    "object": {
      "id": "cs_test_b1Cv0cnyPpY7rjtFmNLutGKqsds0Ileam0PbgdIFiU9Lz5toeTOoCN9vOi",
      "object": "checkout.session",
      "after_expiration": null,
      "allow_promotion_codes": true,
      "amount_subtotal": 2100,
      "amount_total": 2100,
      "automatic_tax": {
        "enabled": false,
        "status": null
      },
      "billing_address_collection": null,
      "cancel_url": "http://localhost:4400/subscriptions/cancelled/",
      "client_reference_id": "1",
      "consent": null,
      "consent_collection": null,
      "created": 1685101408,
      "currency": "usd",
      "currency_conversion": null,
      "custom_fields": [
      ],
      "custom_text": {
        "shipping_address": null,
        "submit": null
      },
      "customer": "STRIPE_CUSTOMER_ID",
      "customer_creation": null,
      "customer_details": {
        "address": {
          "city": null,
          "country": "US",
          "line1": null,
          "line2": null,
          "postal_code": "12345",
          "state": null
        },
        "email": "astrobin@astrobin.com",
        "name": "Test User",
        "phone": null,
        "tax_exempt": "none",
        "tax_ids": [
        ]
      },
      "customer_email": null,
      "expires_at": 1685187807,
      "invoice": null,
      "invoice_creation": {
        "enabled": false,
        "invoice_data": {
          "account_tax_ids": null,
          "custom_fields": null,
          "description": null,
          "footer": null,
          "metadata": {
          },
          "rendering_options": null
        }
      },
      "livemode": false,
      "locale": null,
      "metadata": {
        "autorenew": "false",
        "product": "ultimate"
      },
      "mode": "payment",
      "payment_intent": "pi_3NBz3LC0tT6bv7Hd0i65jNq8",
      "payment_link": null,
      "payment_method_collection": "always",
      "payment_method_options": {
      },
      "payment_method_types": [
        "card"
      ],
      "payment_status": "paid",
      "phone_number_collection": {
        "enabled": false
      },
      "recovered_from": null,
      "setup_intent": null,
      "shipping": null,
      "shipping_address_collection": null,
      "shipping_options": [
      ],
      "shipping_rate": null,
      "status": "complete",
      "submit_type": null,
      "subscription": null,
      "success_url": "http://localhost:4400/subscriptions/success?product=ultimate&session_id={CHECKOUT_SESSION_ID}",
      "total_details": {
        "amount_discount": 0,
        "amount_shipping": 0,
        "amount_tax": 0
      },
      "url": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": null,
    "idempotency_key": null
  },
  "type": "checkout.session.completed"
}
